       INICIALIZA-TABLA-LETRAS-DNI.
           MOVE 'T' TO LETRAS-DNI(1)
           MOVE 'R' TO LETRAS-DNI(2)
           MOVE 'W' TO LETRAS-DNI(3)
           MOVE 'A' TO LETRAS-DNI(4)
           MOVE 'G' TO LETRAS-DNI(5)
           MOVE 'M' TO LETRAS-DNI(6)
           MOVE 'Y' TO LETRAS-DNI(7)
           MOVE 'F' TO LETRAS-DNI(8)
           MOVE 'P' TO LETRAS-DNI(9)
           MOVE 'D' TO LETRAS-DNI(10)
           MOVE 'X' TO LETRAS-DNI(11)
           MOVE 'B' TO LETRAS-DNI(12)
           MOVE 'N' TO LETRAS-DNI(13)
           MOVE 'J' TO LETRAS-DNI(14)
           MOVE 'Z' TO LETRAS-DNI(15)
           MOVE 'S' TO LETRAS-DNI(16)
           MOVE 'Q' TO LETRAS-DNI(17)
           MOVE 'V' TO LETRAS-DNI(18)
           MOVE 'H' TO LETRAS-DNI(19)
           MOVE 'L' TO LETRAS-DNI(20)
           MOVE 'C' TO LETRAS-DNI(21)
           MOVE 'K' TO LETRAS-DNI(22)
           MOVE 'E' TO LETRAS-DNI(23).

       CALCULA-LETRA-DNI.
           DIVIDE 23 INTO NUMERO-DNI GIVING DIVISION23 REMAINDER RESTO23
           ADD 1 TO RESTO23.
