       01 LETRAS-DNI   PIC X OCCURS 23 TIMES.
       77 NUMERO-DNI   PIC 9(8) VALUE ZEROS.
       77 DIVISION23   PIC 9(8) VALUE ZEROS.
       77 RESTO23      PIC 99 VALUE ZEROS.