       01 REG-TIPO-MOVIMIENTO.
        03 ID-TIPO-MOV       PIC 99.
        03 DESC-TIPO-MOV     PIC X(45).
        03 SIGNO-TIPO-MOV    PIC X.
        03 IMPORTE-MINIMO    PIC S9(10)V99.
        
