      * COPY ARCHIVO TIPOS DOCUMENTOS.
           01 REG-TIPO-DOCUMENTO.
             03 ID-TIPO-DOC       PIC X.
             03 DESC-TIPO-DOC     PIC X(100).
             03 TIENE-LETRA       PIC X.

