       IDENTIFICATION DIVISION.
       PROGRAM-ID. BANKCOBOL.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
           DISPLAY "Hola mundo".
           STOP RUN.
       END PROGRAM BANKCOBOL.