       INTRODUCE-DATOS-CLIENTE.
           DISPLAY "Tipo de documento: "
           ACCEPT TIPO-DOC
           DISPLAY "Número documento: "
           ACCEPT NUMERO-DOC
           DISPLAY "Letra DNI: "
           ACCEPT LETRA-DNI
           DISPLAY "Nombre: "
           ACCEPT NOMBRE-CLIENTE
           DISPLAY "Apellidos: "
           ACCEPT APELLIDOS-CLIENTE
           DISPLAY "Dirección: "
           ACCEPT DIRECCION-CLIENTE
           DISPLAY "Código postal: "
           ACCEPT CPOSTAL-CLIENTE
           DISPLAY "Teléfono: "
           ACCEPT TELEF-CLIENTE
           DISPLAY "Email: "
           ACCEPT EMAIL-CLIENTE
           MOVE 0 TO TARJETA
           MOVE 0 TO PLAZOF
           MOVE 0 TO CREDITO
           MOVE 0 TO HIPOTECA.
